In [66]:
# Add the Pandas dependency.
import pandas as pd

In [67]:
#Files to load. 第一种方法 declare two variables: 
#one assigned to the schools_complete.csv file 
#one assigned to the students_complete.csv file

school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

In [68]:
# 第二种方法 使用以前学过的 os.path.join()，但是要用到OS 模块


#import pandas as pd
#import os

#school_data_to_load = os.path.join("Resources", "schools_complete.csv")
#student_data_to_load = os.path.join("Resources", "students_complete.csv")

In [69]:
# Read the school data file and store it in a Pandas DataFrame.
# Read each CSV file with the Pandas function "read_csv()"". 
# Inside this function, add the file we want to read, which is one of many parameters.
# The read_csv() function makes it easier for us by converting the CSV file to a DataFrame.
# 也就是说，对于csv文件的数据，不需要使用 pd.DataFrame() function 来转换
# 而是直接用 pd.read_csv() function，自动转化成 DataFrame 格式

school_data_df = pd.read_csv(school_data_to_load)
school_data_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [70]:
# 同样地，Read the student data file and store it in a Pandas DataFrame.
student_data_df = pd.read_csv(student_data_to_load)

# 但是全部打印出来太长，截取一部分打印
# view the first five rows of a DataFrame, use the head() method after the DataFrame name
# view the last five rows of a DataFrame, use tail() method after the DataFrame name.
# view any number of rows in a DataFrame, place a number inside the parentheses. 
# get the top 10 rows, use df.head(10). To get the bottom 10 rows, use df.tail(10).


student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [71]:
student_data_df.tail()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
39165,39165,Donna Howard,F,12th,Thomas High School,99,90
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75

In [72]:
# 读入数据后 要进行 Data-Cleaning Process,
# 第一步， determine if there are missing values in the rows of the CSV files
# 使用 the count() ，  isnull() and  notnull() 3个methods.

In [73]:
# With the count() method, we can get a count of the rows for each column containing data. 
# By default, "null" values are not counted, quickly identify which columns have missing data.

school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [74]:
student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [75]:
# isnull() method to a column, Series, or a DataFrame, a Boolean value will be returned, 
# "True" for the row or rows that are empty,
# null, or "False" for the rows that are not empty.

school_data_df.isnull()

    School ID  school_name   type   size  budget
0       False        False  False  False   False
1       False        False  False  False   False
2       False        False  False  False   False
3       False        False  False  False   False
4       False        False  False  False   False
5       False        False  False  False   False
6       False        False  False  False   False
7       False        False  False  False   False
8       False        False  False  False   False
9       False        False  False  False   False
10      False        False  False  False   False
11      False        False  False  False   False
12      False        False  False  False   False
13      False        False  False  False   False
14      False        False  False  False   False

In [76]:
# 为了更直观，找出空的个数，再追加sum()方法
# To get the total number of empty rows, or rows that are "True," 
# we can use the Pandas sum() method after the isnull() method

school_data_df.isnull().sum()

School ID      0
school_name    0
type           0
size           0
budget         0
dtype: int64

In [77]:
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [78]:
# 同理， notnull() method to a column, Series, or a DataFrame, a Boolean will be returned:
# "True" for the row or rows that are not empty, 
# “False" for the row or rows that are empty.
school_data_df.notnull()

    School ID  school_name  type  size  budget
0        True         True  True  True    True
1        True         True  True  True    True
2        True         True  True  True    True
3        True         True  True  True    True
4        True         True  True  True    True
5        True         True  True  True    True
6        True         True  True  True    True
7        True         True  True  True    True
8        True         True  True  True    True
9        True         True  True  True    True
10       True         True  True  True    True
11       True         True  True  True    True
12       True         True  True  True    True
13       True         True  True  True    True
14       True         True  True  True    True

In [79]:
# 同理， 为了更直观，找出空的个数，再追加sum()方法
# To get the total number of "not empty" rows, or rows that are "True," 
# we can use the Pandas sum() method after the notnull() method

school_data_df.notnull().sum()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [80]:
student_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [81]:
# Determine data types for the school DataFrame using dtype attribute 
school_data_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [82]:
# Use the dtype attribute on a single column
# df.column.dtype if the column name doesn't have any spaces in the name, 
# df["column"].dtype  If there are spaces, like "school_name"

school_data_df.budget.dtypes

# Or school_data_df["budget"].dtypes

dtype('int64')

In [83]:
school_data_df["school_name"].dtypes

dtype('O')

In [84]:
# Determine data types for the student DataFrame.
student_data_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

In [85]:
# Add each prefix and suffix to remove to a list.注意每个词要添加一个空格，以便一同被去掉
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

In [86]:
# Iterate through the "prefixes_suffixes" list and 
# replace them with an empty space""， when it appears in the student's name.
for word in prefixes_suffixes:
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")

student_data_df.head(10)

/var/folders/st/037956s9171clq9y66m7k_000000gn/T/ipykernel_1413/1321642570.py:4: FutureWarning: The default value of regex will change from True to False in a future version.
  student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84
5,5,Bryan Miranda,M,9th,Huang High School,94,94
6,6,Sheena Carter,F,11th,Huang High School,82,80
7,7,Nicole Baker,F,12th,Huang High School,96,69
8,8,Michael Roth,M,10th,Huang High School,95,87
9,9,Matthew Greene,M,10th,Huang High School,96,84

In [87]:
# Generate a high-level snapshot of the school district summary in a single table format
# need to merge the 2 DataFrames and perform analysis on the single, merged DataFrame.
# To merge 2 DataFrames, there must be a shared column in each of the DataFrames with the same name
# The shared column is "school_name". Inside the () of the merge() method, we'll do the following:

# (1)Add the 2 DataFrames to be merged.
# (2)Add the shared column to each DataFrame so that the merge can occur.
# (3)Define how the DataFrames should be merged: left, right, inner, or outer. The default is inner.

In [88]:
# create a new DataFrame for the merged DataFrames, Combine the data into a single dataset.
school_data_complete_df = pd.merge(student_data_df, school_data_df, on=["school_name", "school_name"])

school_data_complete_df.head(10)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
7,7,Nicole Baker,F,12th,Huang High School,96,69,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [89]:
# Get the total number of students.
student_count = school_data_complete_df.count()
student_count

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
School ID        39170
type             39170
size             39170
budget           39170
dtype: int64

In [90]:
# we can choose any one of the columns and get the student count 
# using the following format:
# school_data_complete_df[column].count(). 注意 column name 要加双引号，否则报错

student_count = school_data_complete_df["Student ID"].count()
student_count

39170

In [91]:
# Calculate the total number of schools.
school_count = school_data_df["school_name"].count()
school_count

15

In [92]:
# 或者 使用merged df, 但要使用uniqure() method， 否则输出39170
# DF.uniqure() method 输出的是一个list， count()只能作用在DF上
school_count_2 = school_data_complete_df["school_name"].unique()
school_count_2

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [93]:
school_count_2 = school_data_complete_df["school_name"].unique().count()

AttributeError: 'numpy.ndarray' object has no attribute 'count'

In [94]:
# 使用len() function, 
# The function len() is one of Python's built-in functions. 
# It returns the length of an object, example, the number of items in a list.
school_count_2 = len(school_data_complete_df["school_name"].unique())

school_count_2

15

In [95]:
# Calculate the total budget. 注意是 school_data_df 而不是school_data_complete_df
# 因为 school_data_complete_df 中 "budget" 不是 uniqure的， 会重复计算
total_budget = school_data_df["budget"].sum()
total_budget

24649428

In [96]:
# Calculate the average reading score.
average_reading_score = school_data_complete_df["reading_score"].mean()

average_reading_score

81.87784018381414

In [97]:
# 或直接从 student_data_df 里计算
average_reading_score = student_data_df["reading_score"].mean()
average_reading_score

81.87784018381414

In [98]:
# Calculate the average math score.
average_math_score = school_data_complete_df["math_score"].mean()
average_math_score

78.98537145774827

In [99]:
# 或直接从 student_data_df 里计算
average_math_score = student_data_df["math_score"].mean()
average_math_score

78.98537145774827

In [110]:
# Assign a "passing_math" variable to the math_score column in school_data_complete_df, 
# where all the math scores are equal to or greater than 70.
# the variable have Boolean values for the rows, where "True" means >= 70
passing_math = school_data_complete_df["math_score"] >= 70
passing_math

0         True
1        False
2        False
3        False
4         True
         ...
39165     True
39166     True
39167     True
39168     True
39169     True
Name: math_score, Length: 39170, dtype: bool

In [111]:
# Assign "passing_reading" variable to the math_score column in school_data_complete_df, 
# where all the math scores are equal to or greater than 70
# the variable have Boolean values for the rows, where "True" means >= 70
passing_reading = school_data_complete_df["reading_score"] >= 70
passing_reading

0        False
1         True
2         True
3        False
4         True
         ...
39165     True
39166     True
39167     True
39168     True
39169     True
Name: reading_score, Length: 39170, dtype: bool

In [112]:
# Get all the students who are passing math in a new DataFrame.
# Filter school_data_complete_df DataFrame for the "True" cases
# passing_math_df = school_data_complete_df[school_data_complete_df["math_score"] >= 70]
# 将DataFrame中符合条件的rows 过滤出来， 放入一个另一DataFrame中
passing_math_df = school_data_complete_df[passing_math]
passing_math_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635

In [113]:
# Get all the students that are passing reading in a new DataFrame.
# passing_reading_df = school_data_complete_df[school_data_complete_df["reading_score"] >= 70]
# 将DataFrame中符合条件的rows 过滤出来， 放入一个另一DataFrame中
passing_reading_df = school_data_complete_df[passing_reading]

passing_reading_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635

In [116]:
# get the number of students who passed math
passing_math_count = passing_math_df["student_name"].count()
passing_math_count

29370

In [117]:
# get the number of students who passed reading
passing_reading_count = passing_reading_df["student_name"].count()
passing_reading_count

33610

In [119]:
# Calculate the percent that passed math.
# student_count = school_data_complete_df["Student ID"].count()
# = 39170
# passing_math_percentage = passing_math_count / float(student_count) * 100
# if needed, convert to a number with floating-point decimal, by using float().
passing_math_percentage = passing_math_count / student_count * 100
passing_math_percentage

74.9808526933878

In [120]:
# Calculate the percent that passed reading.
# passing_reading_percentage = passing_reading_count / float(student_count) * 100
passing_reading_percentage = passing_reading_count / student_count * 100
passing_reading_percentage

85.80546336482001

In [121]:
# Calculate the percentage of students who passed both math and reading.

In [122]:
# passing_math_reading_df = 
# school_data_complete_df[(school_data_complete_df["math_score"] >= 70) & 
# (school_data_complete_df["reading_score"] >= 70)]

passing_math_reading_df = school_data_complete_df[passing_math & passing_reading]
passing_math_reading_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [123]:
# get the total number of students who passed both math and reading.

passing_math_reading_count = passing_math_reading_df["student_name"].count()
passing_math_reading_count

25528

In [124]:
# 或者另一种表达式
passing_math_reading_count = passing_math_reading_df.student_name.count()
passing_math_reading_count

25528

In [125]:
# Calculate the overall passing percentage.
overall_passing_percentage = passing_math_reading_count / student_count * 100
overall_passing_percentage

65.17232575950983